# Regular brew formulae
brew "direnv"               # Loading .envrc files
brew "fzf"                  # Fuzzy finder
brew "gh"                   # GitHub CLI
brew "git"                  # Recent version of git
brew "git-delta"            # Better git diff output
brew "glow"                 # Command line markdown renderer
brew "gnupg"                # GPG 2
brew "jq"                   # JSON swiss army knife
brew "kopia"                # Backups
brew "mas"                  # Manage Mac App Store apps from the command line
brew "pinentry-mac"         # Enables GPG <> Keychain integration
brew "pngcrush"             # Compress png images
brew "rbspy"                # Sampling profiler for Ruby
brew "ripgrep"              # Faster ag built in Rust
brew "shellcheck"           # Shell linter
brew "socat"                # Socket swiss army knife
brew "the_silver_searcher"  # Faster ack
brew "tmate"                # Multiplayer terminal
brew "tmux"                 # Terminal multiplexer
brew "tree"                 # Show directory trees
brew "watch"                # Run a program periodically
brew "wget"                 # Download things
brew "youtube-dl"           # Download youtube videos

# Custom taps
tap "hmarr/tap"
brew "hmarr/tap/codeowners" # Check code ownership

# Casks
cask "alacritty"            # Fast, minimal terminal
cask "docker"               # Containers
cask "raycast"              # Spotlight++
cask "rectangle"            # Window manager
cask "spotify"              # Ear candy
cask "unshaky"              # Prevent duplicate keypresses
cask "vitals"               # Process resource monitor
cask "visual-studio-code"   # Editor / IDE

# App Store apps
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Dato", id: 1470584107
mas "Gifski", id: 1351639930
mas "Hand Mirror", id: 1502839586
mas "Hidden Bar", id: 1452453066
mas "Tailscale", id: 1475387142
mas "Tweetbot", id: 1384080005
mas "WhatsApp", id: 1147396723

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
